Autodesk.Revit.DB.ImagePlacementOptions.Location
The location in the model where a point of the Autodesk.Revit.DB.ImageInstance, determined by the Autodesk.Revit.DB.ImagePlacementOptions.PlacementPoint property, is going to be inserted.
Remarks:
The location represents a point in the model where the Autodesk.Revit.DB.ImageInstance will be placed.
The location of the image in the view is determined by the projection of this
point onto the plane of the view.
This means that in a plan view, for example, the z-coordinate has no effect.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImagePlacementOptions.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoxPlacement)
Constructs a new ImagePlacementOptions for placing an Autodesk.Revit.DB.ImageInstance
location:
The location where the image will be placed
placementPoint:
The point of the image that will be aligned to the location in the view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020